ivanovp/pifs/demo/stm32_f4ve_pifs/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "fatfs.h"

/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#include <math.h>
#include "common.h"
#include "uart.h"
#include "term.h"
#include "dht.h"
#include "buffer.h"

#define DISABLE_WATCHDOG_MAGIC  0xDEADBEEF
#define ENABLE_TERMINAL         1
#define ENABLE_FLASH_TEST       0
#define ENABLE_PIFS_TEST        0
#define ENABLE_ERASE_ALL        0
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
CRC_HandleTypeDef hcrc;

IWDG_HandleTypeDef hiwdg;

RTC_HandleTypeDef hrtc;

SD_HandleTypeDef hsd;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_rx;
DMA_HandleTypeDef hdma_spi1_tx;

UART_HandleTypeDef huart1;

NAND_HandleTypeDef hnand1;

osThreadId defaultTaskHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

osThreadId watchdogTaskHandle;
osThreadId measureTaskHandle;
osMutexDef(printf_mutex);
osMutexId printf_mutex = NULL;
osMutexDef(stdin_mutex);
osMutexId stdin_mutex = NULL;
uint32_t disableWatchdog = 0;
FATFS sd_fat_fs;
char disk_path[4];
DIR dir;
FILINFO filinfo;

extern void defaultTask(void const * argument);
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_IWDG_Init(void);
static void MX_SDIO_SD_Init(void);
static void MX_RTC_Init(void);
static void MX_FSMC_Init(void);
static void MX_CRC_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

void watchdogTask(void const * arg);
void measureTask(void const * arg);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
static inline void LED_on(int number)
{
    if (number == 2)
    {
        HAL_GPIO_WritePin(D2_GPIO_Port, D2_Pin, GPIO_PIN_RESET);
    }
    else if (number == 3)
    {
        HAL_GPIO_WritePin(D3_GPIO_Port, D3_Pin, GPIO_PIN_RESET);
    }
}

static inline void LED_off(int number)
{
    if (number == 2)
    {
        HAL_GPIO_WritePin(D2_GPIO_Port, D2_Pin, GPIO_PIN_SET);
    }
    else if (number == 3)
    {
        HAL_GPIO_WritePin(D3_GPIO_Port, D3_Pin, GPIO_PIN_SET);
    }
}

static inline void LED_toggle(int number)
{
    if (number == 2)
    {
        HAL_GPIO_TogglePin(D2_GPIO_Port, D2_Pin);
    }
    else if (number == 3)
    {
        HAL_GPIO_TogglePin(D3_GPIO_Port, D3_Pin);
    }
}

uint8_t nand_buf[512];

/**
 * @brief ftest Testing NAND flash wired to TFT connector.
 */
void ftest(void)
{
    static uint32_t cntr = 0;
    NAND_IDTypeDef nand_id;
    HAL_StatusTypeDef stat;
    NAND_AddressTypeDef address;

#if 1
    printf("Reading NAND ID... ");
    stat = HAL_NAND_Read_ID(&hnand1, &nand_id);
    if (stat == HAL_OK)
    {
        printf("Ok.\r\n");
        printf("NAND ID: %02X %02X %02X %02X\r\n",
               nand_id.Maker_Id,
               nand_id.Device_Id,
               nand_id.Third_Id,
               nand_id.Fourth_Id);
    }
    else
    {
        printf("Error: %i\r\n", stat);
    }
#endif
    address.Block = cntr;
    address.Page = cntr++;
    address.Plane = 0;
    printf("Erase block %i...", address.Block);
    stat = HAL_NAND_Erase_Block(&hnand1, &address);
    if (stat == HAL_OK)
    {
        printf("Ok.\r\n");
    }
    else
    {
        printf("Error: %i\r\n", stat);
    }

    fill_buffer(nand_buf, sizeof(nand_buf), FILL_TYPE_SEQUENCE_WORD, 1);

    printf("Writing %i pages at BA%i/PA%i/PL%i...",
           sizeof(nand_buf) / hnand1.Config.PageSize,
           address.Block, address.Page, address.Plane);
    stat = HAL_NAND_Write_Page_8b(&hnand1, &address, &nand_buf, sizeof(nand_buf) / hnand1.Config.PageSize);
    if (stat == HAL_OK)
    {
        printf("Ok.\r\n");
    }
    else
    {
        printf("Error: %i\r\n", stat);
    }

    memset(nand_buf, 0, sizeof(nand_buf));

    printf("Reading %i pages at BA%i/PA%i/PL%i...",
           sizeof(nand_buf) / hnand1.Config.PageSize,
           address.Block, address.Page, address.Plane);
    stat = HAL_NAND_Read_Page_8b(&hnand1, &address, &nand_buf, sizeof(nand_buf) / hnand1.Config.PageSize);
    if (stat == HAL_OK)
    {
        printf("Ok.\r\n");
        print_buffer(nand_buf, sizeof(nand_buf), 0);
    }
    else
    {
        printf("Error: %i\r\n", stat);
    }
}

