ivanovp/pifs/demo/stm32_f4ve_pifs/Src/main.c
#if 0
void HAL_NAND_MspInit(NAND_HandleTypeDef *hnand)
{
    GPIO_InitTypeDef GPIO_InitStruct;

    /* Peripheral clock enable */
    __HAL_RCC_FSMC_CLK_ENABLE();

    /* FSMC GPIO Configuration
      PE7   ------> FSMC_D4
      PE8   ------> FSMC_D5
      PE9   ------> FSMC_D6
      PE10  ------> FSMC_D7
      PD0   ------> FSMC_D2
      PD1   ------> FSMC_D3
      PD4   ------> FSMC_NOE
      PD5   ------> FSMC_NWE
      PD6   ------> FSMC_NWAIT
      PD7   ------> FSMC_NCE2
      PD11  ------> FSMC_CLE
      PD12  ------> FSMC_ALE
      PD14  ------> FSMC_D0
      PD15  ------> FSMC_D1
      */
    GPIO_InitStruct.Pin = GPIO_PIN_0
            | GPIO_PIN_1
            | GPIO_PIN_4
            | GPIO_PIN_5
            | GPIO_PIN_7
            | GPIO_PIN_11
            | GPIO_PIN_12
            | GPIO_PIN_14
            | GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF12_FSMC;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_7
            | GPIO_PIN_8
            | GPIO_PIN_9
            | GPIO_PIN_10;
    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_6;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
}
#endif
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* Enable division by zero fault */
  SCB->CCR |= 0x10;
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_USART1_UART_Init();
  MX_IWDG_Init();
  MX_SDIO_SD_Init();
  MX_RTC_Init();
  MX_FSMC_Init();
  MX_CRC_Init();
  /* USER CODE BEGIN 2 */
  UART_printf_("\r\n\r\nBoard initialized\r\n");
#if DEBUG == 1
  UART_printf_("DEBUG\r\n");
#else
  UART_printf_("RELEASE\r\n");
#endif
  UART_printf_("Compiled on " __DATE__ " " __TIME__ "\r\n");

  if (__HAL_RCC_GET_FLAG(RCC_FLAG_BORRST))
  {
      UART_printf_("POR/PDR or BOR reset.\r\n");
  }
  if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST))
  {
      UART_printf_("Pin reset.\r\n");
  }
  if (__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST))
  {
      UART_printf_("POR/PDR reset.\r\n");
  }
  if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST))
  {
      UART_printf_("Software reset.\r\n");
  }
  if (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST))
  {
      UART_printf_("Independent Watchdog reset.\r\n");
  }
  if (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST))
  {
      UART_printf_("Window Watchdog reset.\r\n");
  }
  if (__HAL_RCC_GET_FLAG(RCC_FLAG_LPWRRST))
  {
      UART_printf_("Low Power reset.\r\n");
  }
  __HAL_RCC_CLEAR_RESET_FLAGS();
#if ENABLE_WATCHDOG
  UART_printf_("Watchdog started\r\n");
  HAL_IWDG_Refresh(&hiwdg);
#else
  UART_printf_("Watchdog disabled\r\n");
#endif
  setbuf(stdout, NULL);
  printf("+++ printf test! +++\r\n");

  printf("Initialize DHT22 sensor... ");
  if (DHT_init())
  {
      printf("Done.\r\n");
  }
  else
  {
      printf("Error!\r\n");
  }

  HAL_StatusTypeDef stat;
  printf("Reset NAND memory... ");
  stat = HAL_NAND_Reset(&hnand1);
  if (stat == HAL_OK)
  {
      printf("Ok.\r\n");
  }
  else
  {
      printf("Error: %i\r\n", stat);
  }

  //ftest();
  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  printf_mutex = osMutexCreate(osMutex(printf_mutex));
  stdin_mutex = osMutexCreate(osMutex(stdin_mutex));
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 512);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  osThreadDef(watchdogTask, watchdogTask, osPriorityRealtime, 0, 64);
  watchdogTaskHandle = osThreadCreate(osThread(watchdogTask), NULL);
  osThreadDef(measureTask, measureTask, osPriorityAboveNormal, 0, 512);
  measureTaskHandle = osThreadCreate(osThread(measureTask), NULL);
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE
                              |RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 60;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 3;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

