ivanovp/pifs/demo/stm32_f4ve_pifs/Src/main.c
  /*Configure GPIO pin : SPI_CS_Pin */
  GPIO_InitStruct.Pin = SPI_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(SPI_CS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : PA11 PA12 */
  GPIO_InitStruct.Pin = GPIO_PIN_11|GPIO_PIN_12;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : DHT22_Pin */
  GPIO_InitStruct.Pin = DHT22_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DHT22_GPIO_Port, &GPIO_InitStruct);

}

/* FSMC initialization function */
static void MX_FSMC_Init(void)
{
  FSMC_NAND_PCC_TimingTypeDef ComSpaceTiming;
  FSMC_NAND_PCC_TimingTypeDef AttSpaceTiming;

  /** Perform the NAND1 memory initialization sequence
  */
  hnand1.Instance = FSMC_NAND_DEVICE;
  /* hnand1.Init */
  hnand1.Init.NandBank = FSMC_NAND_BANK2;
  hnand1.Init.Waitfeature = FSMC_NAND_PCC_WAIT_FEATURE_ENABLE;
  hnand1.Init.MemoryDataWidth = FSMC_NAND_PCC_MEM_BUS_WIDTH_8;
  hnand1.Init.EccComputation = FSMC_NAND_ECC_DISABLE;
  hnand1.Init.ECCPageSize = FSMC_NAND_ECC_PAGE_SIZE_512BYTE;
  hnand1.Init.TCLRSetupTime = 1;
  hnand1.Init.TARSetupTime = 1;
  /* hnand1.Config */
  hnand1.Config.PageSize = 512;
  hnand1.Config.SpareAreaSize = 16;
  hnand1.Config.BlockSize = 32;
  hnand1.Config.BlockNbr = 2048;
  hnand1.Config.PlaneNbr = 1;
  hnand1.Config.PlaneSize = 2048;
  hnand1.Config.ExtraCommandEnable = ENABLE;
  /* ComSpaceTiming */
  ComSpaceTiming.SetupTime = 2;
  ComSpaceTiming.WaitSetupTime = 4;
  ComSpaceTiming.HoldSetupTime = 4;
  ComSpaceTiming.HiZSetupTime = 6;
  /* AttSpaceTiming */
  AttSpaceTiming.SetupTime = 2;
  AttSpaceTiming.WaitSetupTime = 4;
  AttSpaceTiming.HoldSetupTime = 4;
  AttSpaceTiming.HiZSetupTime = 6;

  if (HAL_NAND_Init(&hnand1, &ComSpaceTiming, &AttSpaceTiming) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/* USER CODE BEGIN 4 */
/**
 * @brief watchdogTask LED blinking and watchdog reloading task.
 * @param arg
 */
void watchdogTask(void const * arg)
{
	(void) arg;

	for ( ; ; )
	{
#if ENABLE_WATCHDOG
        /*
         * Watchdog's timeout is 800 ms
         * Oscillator clock (LSI) = 32 kHz
         * Prescaler = /32
         * Down counter reload value = 800
         * Timeout = 1 / ( 40000 / 32 ) * 800 = 0.8 seconds
         */
        if (disableWatchdog != DISABLE_WATCHDOG_MAGIC)
        {
            /* Feed the watchdog */
            HAL_IWDG_Refresh(&hiwdg);
        }
#endif
        LED_toggle(2);
        osDelay(500);
    }
}

#define MEAS_SIZE   42

void save_measurement(void)
{
    typedef struct __attribute__((packed))
    {
        uint8_t  hour : 5;
        uint8_t  min : 6;
        uint8_t  sec : 5;
        int16_t  hum;
        int16_t  temp;
        //float    hum;
        //float    temp;
    } meas_t;
    static meas_t     meas[MEAS_SIZE];
    static uint8_t    meas_idx = 0;
    float             hum;
    float             temp;
    P_FILE          * file;
    size_t            written_bytes;
    HAL_StatusTypeDef stat;
    RTC_DateTypeDef   date;
    RTC_TimeTypeDef   time;
    char              filename[PIFS_FILENAME_LEN_MAX + 1];

    /* First time shall be read */
    stat = HAL_RTC_GetTime(&hrtc, &time, RTC_FORMAT_BIN);
    if (stat == HAL_OK)
    {
        /* After date shall be read */
        stat = HAL_RTC_GetDate(&hrtc, &date, RTC_FORMAT_BIN);
        if (stat == HAL_OK)
        {
            UART_printf("%02i-%02i-%02i %02i:%02i:%02i  ",
                        date.Year, date.Month, date.Date,
                        time.Hours, time.Minutes, time.Seconds);
            hum = DHT_getHumPercent();
            temp = DHT_getTempCelsius();
            UART_printf("Humidity: %i.%i%%  ", (int)hum, (int)fabsf ((hum - (int)hum) * 10.0f));
            UART_printf("T: %i.%i C  ", (int)temp, (int)fabsf ((temp - (int)temp) * 10.0f));
            snprintf(filename, sizeof(filename), "%02i%02i%02i.dat", date.Year, date.Month, date.Date);
            UART_printf("%i/%i\r\n", meas_idx + 1, MEAS_SIZE);

            meas[meas_idx].hour = time.Hours;
            meas[meas_idx].min = time.Minutes;
            meas[meas_idx].sec = time.Seconds >> 1;
            //meas[meas_idx].hum = hum;
            //meas[meas_idx].temp = temp;
            meas[meas_idx].hum = (int16_t)(hum * 10.0f);
            meas[meas_idx].temp = (int16_t)(temp * 10.0f);
            meas_idx++;
            if (meas_idx == MEAS_SIZE)
            {
                meas_idx = 0;
                file = pifs_fopen(filename, "a");
                if (file)
                {
                    written_bytes = pifs_fwrite(&meas, 1, sizeof(meas), file);
                    if (written_bytes == sizeof(meas))
                    {
                        UART_printf("Data saved!\r\n");
                    }
                    else
                    {
                        UART_printf("ERROR: Cannot save data. Code: %i\r\n", pifs_errno);
                    }
                    pifs_fclose(file);
                }
                else
                {
                    UART_printf("ERROR: Cannot open file!\r\n");
                }
            }
        }
    }
}

/**
 * @brief measureTask DHT22 measurement task
 * @param arg
 */
void measureTask(void const * arg)
{
    bool_t   measure_ok = FALSE;
    uint8_t  cntr = 0;
    float    hum = 0;

    (void) arg;

    UART_printf("Measurement task started\r\n");

    /* Drop first measurement */
    DHT_read();

    for ( ; ; )
    {
        osDelay(10000); /* Measure in every 10 second */
        //osDelay(60000); /* Measure in every minute */
        measure_ok = FALSE;
        LED_on(3);

        do
        {
            measure_ok = DHT_read();
            if (measure_ok)
            {
                hum = DHT_getHumPercent();
            }
            else
            {
                osDelay(10);
            }
            cntr++;
        } while (cntr < 5 && (!measure_ok || hum > 100.0f));

        if (measure_ok && hum <= 100.0f)
        {
            save_measurement();
        }
        LED_off(3);
    }
}

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
    (void) xTask;

