ivanovp/pifs/demo/stm32_f4ve_pifs/Src/main.c
    _print("\r\nStack overflow in task ");
    _print(pcTaskName);
    _print("\r\n");
    while(1)
    {
    }
}
/* USER CODE END 4 */

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{
  /* init code for FATFS */
  MX_FATFS_Init();

  /* USER CODE BEGIN 5 */
  (void) argument;
#if ENABLE_TERMINAL
    pifs_status_t ret;
    FRESULT       fres;

    ret = pifs_init();
    if (ret != PIFS_SUCCESS)
    {
        printf("ERROR: Cannot initialize file system: %i\r\n", ret);
    }

    printf("Mounting SD card... ");
    fres = f_mount(&sd_fat_fs, (TCHAR const*)disk_path, 1);
    if (fres == FR_OK)
    {
        printf("Done.\r\n");
        printf("Listing root directory:\r\n");
        fres = f_findfirst(&dir, &filinfo, "", "*");
        while (fres == FR_OK && filinfo.fname[0])
        {
            printf("%-32s %8i\r\n", filinfo.fname, filinfo.fsize);
            fres = f_findnext(&dir, &filinfo);
        }
        printf("Closing directory... ");
        fres = f_closedir(&dir);
        if (fres == FR_OK)
        {
            printf("Done.\r\n");
        }
        else
        {
            printf("ERROR: Cannot close directory: %i\r\n", fres);
        }
        printf("Un-mounting SD card... ");
        fres = f_mount(NULL, (TCHAR const*)disk_path, 0);
        if (fres == FR_OK)
        {
            printf("Done.\r\n");
        }
        else
        {
            printf("ERROR: Cannot unmount SD card: %i\r\n", fres);
        }
    }
    else
    {
        printf("ERROR: Cannot mount SD card: %i\r\n", fres);
    }

    term_init();
    while (1)
    {
        term_task();
    }
#elif ENABLE_FLASH_TEST
    pifs_flash_init();
    flash_test();
    pifs_flash_delete();
#elif ENABLE_PIFS_TEST
#if ENABLE_ERASE_ALL
    pifs_flash_init();
	UART_printf("Erasing all blocks... ");
	if (flash_erase_all() == 0)
	{
	    UART_printf("Done.\r\n");
	}
	else
	{
	    UART_printf("ERROR!\r\n");
	}
	pifs_flash_delete();
#endif
	pifs_init();
	pifs_test();
    pifs_delete();
#endif
	  /* Infinite loop */
    UART_printf("Halting task\r\n");
	for(;;)
	{
	    osDelay(1);
	}
  /* USER CODE END 5 */ 
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM2 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM2) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    _print("\r\nFatal error in file ");
    _print(file);
    _print("at line 0x");
    _printHex32(line);
    _print("\r\n");
    /* User can add his own implementation to report the HAL error return state */
    while(1)
    {
    }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
